{
  "2025": [
    {
      "title": "AI",
      "desc": "Artificial Intelligence overview.",
      "url": "https://ai.google.com"
    },
    {
      "title": "Progressive Hydration",
      "description": "Fine-grained hydration strategies that progressively activate interactivity to minimize JavaScript and speed up Time to Interactive.",
      "url": "https://web.dev/progressive-hydration/",
      "morelink": "Hydration"
    },
    {
      "title": "Composable Data Mesh for Frontend",
      "description": "Decoupled data products and contract-driven APIs that enable teams to compose complex UIs from reusable data services.",
      "url": "https://martinfowler.com/articles/data-mesh-principles.html",
      "morelink": "DataMesh"
    },
    {
      "title": "Zero-trust Web Authentication",
      "description": "Stronger, passwordless authentication patterns (WebAuthn, passkeys) combined with continuous risk signals for secure sessions.",
      "url": "https://webauthn.guide/",
      "morelink": "WebAuthn"
    },
    {
      "title": "Sustainable Web Practices",
      "description": "Design and engineering patterns focused on energy-efficient web apps, lower carbon footprints, and measurable sustainability metrics.",
      "url": "https://www.w3.org/",
      "morelink": "Sustainability"
    },
    {
      "title": "Astro.js",
      "description": "Astro.js is a cutting-edge static site generator designed to make building fast, content-focused websites easier than ever. It embraces the modern concept of shipping less JavaScript by default, making web experiences lightning fast, lightweight, and user-friendly. Unlike traditional frameworks that rely heavily on client-side hydration, Astro renders the majority of your site to static HTML during build time, dramatically improving performance metrics such as Time to Interactive (TTI) and Core Web Vitals.",
      "url": "https://astro.build",
      "morelink": "Astro Official"
    },
    {
      "title": "SolidStart",
      "description": "SolidStart is the official framework for Solid.js, offering hybrid rendering, file-based routing, and optimized performance for modern web apps.",
      "url": "https://start.solidjs.com",
      "morelink": "SolidStart"
    },
    {
      "title": "Remix Run",
      "description": "Remix Run focuses on web fundamentals, offering nested routing, fast data loading, and seamless server rendering for resilient web applications.",
      "url": "https://remix.run",
      "morelink": "Remix"
    },
    {
      "title": "SvelteKit",
      "description": "SvelteKit enables developers to build fast, optimized web apps with minimal overhead, server-side rendering, and first-class TypeScript support.",
      "url": "https://kit.svelte.dev",
      "morelink": "SvelteKit"
    },
    {
      "title": "Next.js 15",
      "description": "Next.js 15 introduces enhanced server components, React compiler support, and improved static generation for performance-driven applications.",
      "url": "https://nextjs.org",
      "morelink": "Next.js"
    },
    {
      "title": "Nuxt 4",
      "description": "Nuxt 4 delivers hybrid rendering, type-safe routes, and Vue 3 Composition API support, making it ideal for universal Vue applications.",
      "url": "https://nuxt.com",
      "morelink": "Nuxt"
    },
    {
      "title": "Vite 6",
      "description": "Vite 6 provides next-generation frontend tooling with ultra-fast Hot Module Replacement and first-class TypeScript and JSX support.",
      "url": "https://vitejs.dev",
      "morelink": "Vite"
    },
    {
      "title": "Capacitor 6",
      "description": "Capacitor 6 by Ionic simplifies native mobile app development using web technologies and offers tighter integration with modern frameworks.",
      "url": "https://capacitorjs.com",
      "morelink": "Capacitor"
    },
    {
      "title": "Electron Forge",
      "description": "Electron Forge streamlines Electron app packaging, auto-updates, and deployment, helping developers ship cross-platform desktop apps efficiently.",
      "url": "https://www.electronforge.io/",
      "morelink": "ElectronForge"
    },
    {
      "title": "Cursor IDE",
      "description": "An AI-native code editor that integrates large language models to understand, autocomplete, and refactor entire codebases intelligently.",
      "url": "https://cursor.sh/",
      "morelink": "Cursor"
    },
    {
      "title": "Replit Ghostwriter 2",
      "description": "Replit’s AI coding assistant offering real-time collaboration, deployment, and debugging assistance across multiple languages.",
      "url": "https://replit.com/",
      "morelink": "Replit"
    }
  ]
}